<?php

if (!function_exists('addpost_placeholder')) {
    function addpost_placeholder(): string
    {
        $list = [
            __('Как прошел Ваш день?'),
            __('Заметили что-то интересное сегодня?'),
            __('Вам не грустно?'),
            __('Есть чем поделиться?'),
            __('Что-то произошло?'),
            __('Хотите сказать что-то важное?'),
            __('Может скажем им...'),
            __('Лучше будет поделиться...'),
            __('Давайте поделимся со всеми!'),
            __('Давайте напишем это!'),
            __('Давайте скажем это!'),
        ];

        return $list[rand(0, count($list) - 1)];
    }
}
