@extends('layouts.main.main')

@section('page.title', __('Документация API Аквариума — руководство для разработчиков'))
@section('page.ogtitle', __('Документация API Аквариума — руководство для разработчиков'))
@section('page.desc',
    __('Полное руководство по API Аквариума. Узнайте, как интегрироваться с платформой, правила
    использования и ссылки на справку.'))
@section('page.ogdesc',
    __('Полное руководство по API Аквариума. Узнайте, как интегрироваться с платформой, правила
    использования и ссылки на справку.'))

    @push('css')
        <link rel="stylesheet" type="text/css" href="{{ asset('css/faq/include.css') }}" />
    @endpush

@section('main.content')
    <div class="row gx-3">
        <div class="col-3 p-3">
            <x-page.title-anchor />
        </div>
        <div class="col-7 p-3">
            <h1>{{ __('API') }}</h1>
            <p class="fs-5">
                {{ __('Интерфейс API – универсальное средство взаимодействия с социальной сетью Аквариум.') }}
            </p>
            <h2>
                {{ __('Введение') }}
            </h2>
            <p>
                {{ __('Интерфейс API (Application Programming Interface) – это набор функций, методов, протоколов и инструментов, предоставляемых социальной сетью Аквариум, который позволяет разработчикам создавать свои приложения, взаимодействовать с данными и функциональностью Аквариума, расширять возможности социальной сети и интегрировать ее с другими приложениями и сервисами.') }}
            </p>
        </div>
    </div>

    <x-button-top />
@endsection

@push('js')
    <script src="{{ asset('js/page/left-bar-anchors.js') }}"></script>
@endpush
