@extends('layouts.main')

@section('page.title', 'OAuth')

@push('css')
<link rel="stylesheet" type="text/css" href="{{ asset('css/faq/index.css') }}" />
<link rel="stylesheet" type="text/css" href="{{ asset('css/oauth/index.css') }}" />
@endpush

@section('main.content')
    <div class="row gx-3">
        <div class="col-3 p-3">
            <ul id="left-bar-anchors"></ul>
        </div>
        <div class="col-7 p-3">
            <h1>{{ __('OAuth') }}</h1>
            <p class="fs-5">
                Открытый протокол авторизации при помощи соцсети Аквариум. С помощью OAuth у пользователей есть возможность входить в аккаунты других сервисов используя аккаунт социальной сети Аквариум. При авторизации у пользователя есть возможность указать, какими данными можно поделиться.
            </p>
            <h2>{{ __('Для чего нужен OAuth?') }}</h2>
            <p>
                Одной из главных целей OAuth является обеспечение безопасности, упрощение процесса авторизации и содействие безопасному обмену данными между пользователями и онлайн-ресурсами.
            </p>
            <p>
                С помощью этой технологии пользователи могут удобно авторизоваться в других сервисах, контролировать доступ к своей личной информации и быть уверенным, что их данные будут передаваться только в соответствии с их собственными настройками и разрешениями.
            </p>
            <p>
                OAuth играет важную роль в создании более сильной, связанной и безопасной онлайн среды. Благодаря этой технологии веб-приложения могут интегрироваться, обмениваться данными и предоставлять передовые услуги, сохраняя при этом высокий уровень безопасности и конфиденциальности.
            </p>
            <h2>{{ __('Дизайн кнопки авторизации') }}</h2>
            <div class="faq-design-button">
                <div class="faq-design-button-light">
                    <button class="btn btn-dark btn-lg">
                        Авторизоваться
                    </button>
                </div>
                <div class="faq-design-button-dark">
                    <button class="btn btn-light btn-lg">
                        Авторизоваться
                    </button>
                </div>
            </div>
            <h2>{{ __('Подключить OAuth') }}</h2>
            <h3>{{ __('Регистрация') }}</h3>
            <p>
                Вам необходимо зарегистрироваться в панели разработчиков Аквариума по <a href="#">ссылке</a>. Вы можете использовать аккаунт Аквариума.
            </p>
            <h3>{{ __('Создание приложения') }}</h3>
            <p>
                После регистрации аккаунта потребуется зарегистрировать приложение по <a href="#">ссылке</a>.
            </p>
            <h3>{{ __('Настройка приложения') }}</h3>
            <h3>{{ __('Токены') }}</h3>
            <h2>{{ __('Пример приложения') }}</h2>
        </div>
    </div>
@endsection

@once
    @push('js')
        <script src="{{ asset('js/page/left-bar-anchors.js') }}"></script>
    @endpush
@endonce
